import * as Yup from "yup";

export const validationSchema = Yup.object({
  name: Yup.string()
    .min(2, "Ім’я має містити щонайменше 2 символи")
    .max(16, "Ім’я не може бути довшим за 16 символів")
    .required("Ім’я обов’язкове"),

  tel: Yup.string()
    .matches(/^\+?\d{10,15}$/, "Будь ласка, введіть дійсний номер телефону")
    .required("Номер телефону обов’язковий"),

  email: Yup.string()
    .min(5, "Електронна пошта має містити щонайменше 5 символів")
    .max(128, "Електронна пошта не може бути довшою за 128 символів")
    .matches(/^[^\s@]+@[^\s@]+\.[^\s@]+$/, "Будь ласка, введіть дійсну електронну пошту")
    .required("Пошта обов’язкова"),

  password: Yup.string()
    .min(8, "Пароль має містити щонайменше 8 символів")
    .max(128, "Пароль не може бути довшим за 128 символів")
    .required("Пароль обов’язковий"),

  checkPassword: Yup.string()
    .oneOf([Yup.ref("password"), null], "Паролі мають співпадати")
    .required("Будь ласка, підтвердіть свій пароль"),

  acceptedTerms: Yup.boolean().oneOf(
    [true],
    "Ви повинні прийняти умови та положення"
  ),
});
